# Переменные, например test = 5

# Целочисленные переменные (integer, int)
number = 5
age = 22
# Вещественное, дробь (float)
number2 = 5.7

# Строка (string, str)
name = "Abraham"
name2 = 'Abraham'

# Константа Булеан (bool) Может принимать только 2 значения: True or False
status = True

# Функция вывода - print
print("Сабацюка")

# Экранирование (чтобы написать слово в кавчках, нужно перед этими доп кавычками поставить \
print("он \"плохой\" человек")

# перевод строки  \n
print("hello \nWorld")

# конкатенация
print("Меня зовут " + name)
# нельзя конкатенировать вместе разные типы переменных, нужно использовать такую конструкцию:
print("Меня зовут " + name + " и мне " + str(age) + " года!")
